Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/P2P_LedButton/Src/lb_demo.c
/**
 ******************************************************************************
 * @file    lb_demo.c
 * @author  MCD Application Team
 * @brief   BLE Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright c 2017 STMicroelectronics International N.V.
 * All rights reserved.</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice, 
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other 
 *    contributors to this software may be used to endorse or promote products 
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this 
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under 
 *    this license is void and will automatically terminate your rights under 
 *    this license. 
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "common.h"
#include "debug.h"

#include "ble_lib.h"
#include "blesvc.h"

#include "lb_demo.h"
#include "lb_server_app.h"

#include "scheduler.h"
#include "debug.h"
#include "tl_types.h"
#include "tl_ble_hci.h"
#include "lpm.h"
#include "tl_ble_reassembly.h"
#include "stm32l475e_iot01.h"

/* Private typedef -----------------------------------------------------------*/

/**
 * security parameters structure
 */ 
typedef struct _tSecurityParams
{
  /**
  * IO capability of the device
  */ 
  uint8_t ioCapability;
  
  /**
  * Authentication requirement of the device
  * Man In the Middle protection required?
  */ 
  uint8_t mitm_mode;
  
  /**
  * bonding mode of the device
  */ 
  uint8_t bonding_mode;
  
  /**
  * Flag to tell whether OOB data has 
  * to be used during the pairing process
  */ 
  uint8_t OOB_Data_Present; 
  
  /**
  * OOB data to be used in the pairing process if 
  * OOB_Data_Present is set to TRUE
  */ 
  uint8_t OOB_Data[16]; 
  
  /**
  * this variable indicates whether to use a fixed pin 
  * during the pairing process or a passkey has to be 
  * requested to the application during the pairing process
  * 0 implies use fixed pin and 1 implies request for passkey
  */ 
  uint8_t Use_Fixed_Pin; 
  
  /**
  * minimum encryption key size requirement
  */ 
  uint8_t encryptionKeySizeMin;
  
  /**
  * maximum encryption key size requirement
  */ 
  uint8_t encryptionKeySizeMax;
  
  /**
  * fixed pin to be used in the pairing process if
  * Use_Fixed_Pin is set to 1
  */ 
  uint32_t Fixed_Pin;
  
  /**
  * this flag indicates whether the host has to initiate
  * the security, wait for pairing or does not have any security
  * requirements.\n
  * 0x00 : no security required
  * 0x01 : host should initiate security by sending the slave security
  *        request command
  * 0x02 : host need not send the clave security request but it
  * has to wait for paiirng to complete before doing any other
  * processing
  */ 
  uint8_t initiateSecurity;
} tSecurityParams;

/**
 * global context
 * contains the variables common to all 
 * services
 */ 
typedef struct _tBLEProfileGlobalContext
{
  /**
   * security requirements of the host
   */ 
  tSecurityParams bleSecurityParam;
  
    /**
     * gap service handle
     */
  uint16_t gapServiceHandle;
  
  /**
   * device name characteristic handle
   */ 
  uint16_t devNameCharHandle;
  
  /**
   * appearance characteristic handle
   */ 
  uint16_t appearanceCharHandle;
  
  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */ 
    uint16_t connectionHandle[BLE_CFG_MAX_CONNECTION];

    /**
   * length of the UUID list to be used while advertising
   */ 
    uint8_t advtServUUIDlen;
  
  /**
   * the UUID list to be used while advertising
   */ 
    uint8_t advtServUUID[100];

}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t LBRContext_legacy;
  LBR_Gap_Gatt_State Remote_Connection_Status[1];
  uint16_t connectionHandleRemote;
} LBRContext_t;

LBR_ConnHandle_Not_evt_t handleNotification;


#if(LB_CLIENT!=0)
typedef struct{
  /**
   * state of the Data Transfer
   * state machine
   */ 
  LBR_Gap_Gatt_State state;

  /**
   * connection handle 
   */ 
  uint16_t connHandle;

   /**
   * handle of the Led Button service
   */ 
  uint16_t LedButtonServiceHandle;

  /**
   * end handle of the Data Transfer service
   */ 
  uint16_t LedButtonServiceEndHandle;

  /**
   * handle of the Tx characteristic 
   * 
   */ 
  uint16_t LedButtonLedCharHdle;

  /**
   * handle of the client configuration
   * descriptor of Tx characteristic
   */ 
  uint16_t LedButtonLedDescHandle;

  /**
   * handle of the client configuration
   * descriptor of new alert characteristic
   */ 

  uint16_t  LedButtonClientCharHdle;                  /**< Characteristic handle */
  uint16_t  LedButtonClientDescHandle;                  /**< Characteristic handle */

}LBR_ClientContext_t;
#endif


#if (LB_SERVER == 1)  

static const char local_name[] = {AD_TYPE_COMPLETE_LOCAL_NAME,'L','B','_','P','2','P','_','S','E','R','V','E','R'};

#endif
 
#if (LB_CLIENT == 1)

/* static  char local_name[] = {AD_TYPE_COMPLETE_LOCAL_NAME,'L','B','_','P','2','P','_','C','L','I','E','N','T'}; */
tBDAddr LB_SERVER_BDADDR = 
{
 (uint8_t)((REMOTE_BD_ADDRESS & 0xFF0000000000) >> 40),
 (uint8_t)((REMOTE_BD_ADDRESS & 0x00FF00000000) >> 32),
 (uint8_t)((REMOTE_BD_ADDRESS & 0x0000FF000000) >> 24),
 (uint8_t)((REMOTE_BD_ADDRESS & 0x000000FF0000) >> 16),
 (uint8_t)((REMOTE_BD_ADDRESS & 0x00000000FF00) >> 8),
 (uint8_t)((REMOTE_BD_ADDRESS & 0x0000000000FF))
};


#endif //LB_CLIENT


/* Private defines -----------------------------------------------------------*/

