Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/P2P_LedButton/Src/lb_demo.c
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

#define POOL_SIZE (CFG_TLBLE_EVT_QUEUE_LENGTH * ( sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE ))


/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/**
 * START of Section BLE_APP_CONTEXT
 */
static LBRContext_t LBRContext;

#if(LB_CLIENT!=0)
static LBR_ClientContext_t aLBRClientContext[BLE_CFG_CLT_MAX_NBR_CB];
#endif

/**
 * END of Section BLE_APP_CONTEXT
 */
uint16_t connection_handle;

/* Global variables ----------------------------------------------------------*/
/*******************************************************************************
 * START of Section BLE_STDBY_MEM
 */
static TL_CmdPacket_t CmdBuffer;

/*******************************************************************************
 * END of Section BLE_STDBY_MEM
 */


/*******************************************************************************
 * START of Section BLE_SHARED_NORET_MEM
 */
static uint8_t EvtPool[POOL_SIZE];

/*******************************************************************************
 * END of Section BLE_SHARED_NORET_MEM
 */

/* Private function prototypes -----------------------------------------------*/
//static void Add_Advertisment_Service_UUID(uint16_t servUUID);
#if(LB_CLIENT!=0)
static SVCCTL_EvtAckStatus_t LBR_Client_Event_Handler(void *pckt);
#endif
/* Functions Definition ------------------------------------------------------*/
__weak void TL_Enable( void );

/* Private functions ----------------------------------------------------------*/


/* Public functions ----------------------------------------------------------*/

void LBR_Init(LBR_InitMode_t InitMode)
{
  uint8_t index;

  if(InitMode != LBR_Limited )
  {
    /**
     * Initialization of all transport layer
     */
    TL_BLE_HCI_Init(TL_BLE_HCI_InitFull, &CmdBuffer, EvtPool, POOL_SIZE);
    TL_Enable();

    /**
     * Initialization of the BLE Controller
     */
     SVCCTL_Init();

    /**
     * Initialization of the BLE App Context
     */
   
    LBRContext.Remote_Connection_Status[0] = LBC_IDLE;
    
   

   
    
    /**
     * Set TX Power to -2dBm.
     * This avoids undesired disconnection due to instability on 32KHz
     * internal oscillator for high transmission power.
     */
    aci_hal_set_tx_power_level(1,0x18);

    /**
     * Initialize IO capability
     */
    LBRContext.LBRContext_legacy.bleSecurityParam.ioCapability = CFG_LBR_IO_CAPABILITY;
    aci_gap_set_io_capability(LBRContext.LBRContext_legacy.bleSecurityParam.ioCapability);

    /**
     * Initialize authentication
     */
    LBRContext.LBRContext_legacy.bleSecurityParam.mitm_mode = CFG_LBR_MITM_PROTECTION;
    LBRContext.LBRContext_legacy.bleSecurityParam.OOB_Data_Present = 0;
    LBRContext.LBRContext_legacy.bleSecurityParam.encryptionKeySizeMin = 8;
    LBRContext.LBRContext_legacy.bleSecurityParam.encryptionKeySizeMax = 16;
    LBRContext.LBRContext_legacy.bleSecurityParam.Use_Fixed_Pin = 0;
    LBRContext.LBRContext_legacy.bleSecurityParam.Fixed_Pin = 111111;
    LBRContext.LBRContext_legacy.bleSecurityParam.bonding_mode = 1;
    for (index=0; index<16 ;index++)
    {
      LBRContext.LBRContext_legacy.bleSecurityParam.OOB_Data[index] = (uint8_t)index;
    }

    aci_gap_set_auth_requirement(LBRContext.LBRContext_legacy.bleSecurityParam.mitm_mode,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.OOB_Data_Present,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.OOB_Data,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.Fixed_Pin,
                                 LBRContext.LBRContext_legacy.bleSecurityParam.bonding_mode);

    /**
     * Initialize whitelist
     */
    if(LBRContext.LBRContext_legacy.bleSecurityParam.bonding_mode)
    {
      aci_gap_configure_whitelist();
    }

    
    /**
     * Initialize LBS Applciation
     */
#if(LB_SERVER!=0)     
    LBSAPP_Init();
   // Start Advertise to be connected by Client
    SCH_SetTask(CFG_IdleTask_StartAdv); 
#endif    
#if(LB_CLIENT!=0)    
    LBSAPP_Init();
    LBR_Client_Init();
    SCH_SetTask(CFG_IdleTask_ConnDev1);
#endif
  
  }

  return;
}



/****************************************************************/
/*                                                              */
/*                     DEVICE IS LB CLIENT                     */
/****************************************************************/
#if(LB_CLIENT!=0) 


void LBR_AppConnReq1(void)
{
  tBleStatus result;
   APPL_MESG_DBG("\r\n\r** CREATE CONNECTION TO SERVER **  \r\n\r");
  
  if(LBRContext.Remote_Connection_Status[0] != LBC_CONNECTED)
  {
    result = aci_gap_create_connection(SCAN_P, 
                                       SCAN_L, 
                                       PUBLIC_ADDR, 
                                       LB_SERVER_BDADDR, 
                                       PUBLIC_ADDR, 
                                       CONN_P1, 
                                       CONN_P2, 
                                       0, 
                                       SUPERV_TIMEOUT, 
                                       CONN_L1 , 
                                       CONN_L2);    
    
    if( result == BLE_STATUS_SUCCESS ) {
      LBRContext.Remote_Connection_Status[0]=LBC_CONNECTING;
     
