Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/P2P_LedButton/Src/lb_demo.c
    }
    else 
    {
      BSP_LED_On(LED2);
      LBRContext.Remote_Connection_Status[0]=LBC_IDLE;
    }
  }
  
  return;
}


void SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_le_connection_complete * connection_complete_event;
  event_pckt = (hci_event_pckt*)((hci_uart_pckt *)pckt)->data;
  
  uint8_t result;
  uint8_t role;
  evt_disconn_complete *cc = (void *)event_pckt->data;
  
  switch(event_pckt->evt)
  {
      
    case EVT_DISCONN_COMPLETE:
      
      
      if(cc->handle == LBRContext.connectionHandleRemote){
        APPL_MESG_DBG("\r\n\r** DISCONNECTION EVENT OF SERVER \n");
        LBRContext.Remote_Connection_Status[0] = LBC_IDLE;
        LBRContext.connectionHandleRemote = 0xFFFF;
        handleNotification.LBR_Evt_Opcode=LB_SERVER_DISCON_EVT;
        handleNotification.ConnectionHandle=connection_handle;
        LBR_Notification(&handleNotification);
      }
 
      break; /* EVT_DISCONN_COMPLETE */

        
    case EVT_LE_META_EVENT:
    
      meta_evt = (evt_le_meta_event*)event_pckt->data;

      switch(meta_evt->subevent)
      {
           
        case EVT_LE_CONN_COMPLETE:
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (evt_le_connection_complete *)meta_evt->data;
         
          connection_handle = connection_complete_event->handle;
          role = connection_complete_event->role;
          if(role == 0x00){ //ROLE MASTER
            
            uint8_t dev1=1;
            
            for (int i=0 ; i <6 ; i++) {
              dev1 &= (LB_SERVER_BDADDR[i] == connection_complete_event->peer_bdaddr[i]);
              
            }
             
            if(dev1==1) {
             // Inform Application it is End Device 1
              APPL_MESG_DBG("-- CONNECTION SUCCESS WITH SERVER\n");
              LBRContext.Remote_Connection_Status[0]=LBC_CONNECTED;
              LBRContext.connectionHandleRemote = connection_handle;
              LBRContext.LBRContext_legacy.connectionHandle[0] = connection_handle;
              handleNotification.LBR_Evt_Opcode=LB_SERVER_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle=connection_handle;
              LBR_Notification(&handleNotification);
              
              result = aci_gatt_disc_all_prim_services(connection_handle);
              
              if( result == BLE_STATUS_SUCCESS )     {
                APPL_MESG_DBG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n");
                APPL_MESG_DBG("* GATT :  Start Searching Primary Services \r\n\r");
              }            else             {
                APPL_MESG_DBG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
                            
            }

          } 
      
                    
         break; /* HCI_EVT_LE_CONN_COMPLETE */
         
       
            
      } //end switch meta_event ...
    
    break; /* HCI_EVT_LE_META_EVENT */
  
  }

  return;
}

/****************************************************************/
/*                                                              */
/*                      CLIENT                           */
/****************************************************************/
/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t LBR_Client_Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blue_aci *blue_evt;
  LBR_Client_App_Notification_evt_t Notification;

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch(event_pckt->evt)
  {
    case EVT_VENDOR:
    {
      blue_evt = (evt_blue_aci*)event_pckt->data;
      switch(blue_evt->ecode)
      {
        case EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP:
        {
          evt_att_read_by_group_resp *pr = (void*)blue_evt->data;
          /*APPL_MESG_DBG("EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP - connection handle 0x%x !\n", pr->conn_handle);*/
          uint8_t numServ, i, idx;
          uint16_t uuid, handle;

          uint8_t index;
          handle = pr->conn_handle;
          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                    (aLBRClientContext[index].state != LBC_IDLE))
          {
             LBR_Gap_Gatt_State status;
                
             status = LBR_Get_Client_Connection_Status(aLBRClientContext[index].connHandle);
             if((aLBRClientContext[index].state == LBC_CONNECTED)&&
                 (status == LBC_IDLE))
                {
                  /* Handle deconnected */

                  aLBRClientContext[index].state = LBC_IDLE;
                  aLBRClientContext[index].connHandle = 0xFFFF;
                  break;
                }
            index++;
          }
          
          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {
            aLBRClientContext[index].connHandle= handle;

            numServ = (pr->event_data_length - 1) / pr->attribute_data_length;

            /* the event data will be
             * 2bytes start handle
             * 2bytes end handle
             * 2 or 16 bytes data
             * we are intersted only if the UUID is 16 bit.
             * So check if the data length is 6
             */
            if (pr->attribute_data_length == 6)
            {
              idx = 4;
              for (i=0; i<numServ; i++)
              {
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->attribute_data_list[idx]);
                if(uuid == LED_BUTTON_SERVICE_UUID)
                {
                  APPL_MESG_DBG("-- GATT : LED_BUTTON_SERVICE_UUID FOUND - connection handle 0x%x \n", aLBRClientContext[index].connHandle);
                  aLBRClientContext[index].LedButtonServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->attribute_data_list[idx-4]);
                  aLBRClientContext[index].LedButtonServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->attribute_data_list[idx-2]);
                  aLBRClientContext[index].state = LBC_DISCOVER_CHARACS ;
                }
                idx += 6;
              }
            }
          }
        }
        break;

        
