Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/P2P_LedButton/Src/lb_demo.c
        case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
        {
          
          evt_att_read_by_type_resp *pr = (void*)blue_evt->data;
          /* APPL_MESG_DBG("EVT_BLUE_ATT_READ_BY_TYPE_RESP - connection handle 0x%x !\n", pr->conn_handle); */
          uint8_t idx;
          uint16_t uuid, handle;

          /* the event data will be
           * 2 bytes start handle
           * 1 byte char properties
           * 2 bytes handle
           * 2 or 16 bytes data
           */
          
          uint8_t index;
              
          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                (aLBRClientContext[index].connHandle != pr->conn_handle))
          {
            index++;
          }

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {
            /* we are interested in only 16 bit UUIDs */
            idx = 5;
            if (pr->handle_value_pair_length == 7)  
            {
              pr->event_data_length -= 1;
              while(pr->event_data_length > 0)
              {
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->handle_value_pair[idx]);
                /* store the characteristic handle not the attribute handle */
                handle = UNPACK_2_BYTE_PARAMETER(&pr->handle_value_pair[idx-2]);
            
                if(uuid == LED_CHAR_UUID)
                {
                  APPL_MESG_DBG("-- GATT : LED_CHAR_UUID FOUND - connection handle 0x%x\n", aLBRClientContext[index].connHandle);
                  aLBRClientContext[index].state = LBC_DISCOVER_LED_CHAR_DESC;
                  aLBRClientContext[index].LedButtonLedCharHdle = handle;
                }
                else if(uuid == BUTTON_CHAR_UUID)
                {
                  APPL_MESG_DBG("-- GATT : BUTTON_CHAR_UUID FOUND  - connection handle 0x%x\n", aLBRClientContext[index].connHandle);
                  aLBRClientContext[index].state = LBC_DISCOVER_BUTTON_CHAR_DESC;
                  aLBRClientContext[index].LedButtonClientCharHdle = handle;
                }
                pr->event_data_length -= 7;//7;
                idx += 7;//7;
              }
            }
          }
        }
        break;
        
        
        case EVT_BLUE_ATT_FIND_INFORMATION_RESP:
        {
          
          evt_att_find_information_resp *pr = (void*)blue_evt->data;
          
          uint8_t numDesc, idx, i;
          uint8_t index;
          uint16_t uuid, handle;

          /*
           * event data will be of the format
           * 2 bytes handle
           * 2 bytes UUID
           */

          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                (aLBRClientContext[index].connHandle != pr->conn_handle))
          {      
            index++;
          }  

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {
            numDesc = (pr->event_data_length) / 4;
            /* we are interested only in 16 bit UUIDs */
            idx = 0;
            if (pr->format == UUID_TYPE_16)
            {
              for (i=0; i<numDesc; i++)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->handle_uuid_pair[idx]);
                uuid = UNPACK_2_BYTE_PARAMETER(&pr->handle_uuid_pair[idx+2]);

                if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
                {
                  APPL_MESG_DBG("-- GATT : CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID- connection handle 0x%x\n", aLBRClientContext[index].connHandle);
                  if( aLBRClientContext[index].state == LBC_DISCOVER_BUTTON_CHAR_DESC)
                  {
                    aLBRClientContext[index].LedButtonClientDescHandle = handle;
                    aLBRClientContext[index].state = LBC_ENABLE_NOTIFICATION_BUTTON_DESC;
                  }
                }
                idx += 4;
              }
            }  
          }  
        }
        break; /*EVT_BLUE_ATT_FIND_INFORMATION_RESP*/

        
        case EVT_BLUE_GATT_NOTIFICATION:
        {
          evt_gatt_attr_notification *pr = (void*)blue_evt->data;
          uint8_t index;
              
          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                (aLBRClientContext[index].connHandle != pr->conn_handle))
          {
            index++;
          }

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {
          
            if ( (pr->attr_handle == aLBRClientContext[index].LedButtonClientCharHdle) &&
                 (pr->event_data_length > (2)) )
            {
              APPL_MESG_DBG("-- GATT : BUTTON CHARACTERISTICS RECEIVED_EVT - connection handle 0x%x\n", aLBRClientContext[index].connHandle);
              Notification.LBR_Client_Evt_Opcode = LBC_BUTTON_INFO_RECEIVED_EVT;
              Notification.DataTransfered.Length = pr->event_data_length;
              Notification.DataTransfered.pPayload = &pr->attr_value[0];

              LBR_Client_App_Notification(&Notification); 
            
              /* INFORM APPLICATION BUTTON IS PUSHED BY END DEVICE */
            }
          }
        }
        break;/* end EVT_BLUE_GATT_NOTIFICATION */
        
        case EVT_BLUE_GATT_PROCEDURE_COMPLETE:
        {
          evt_gatt_procedure_complete *pr = (void*)blue_evt->data;
          APPL_MESG_DBG("-- GATT : EVT_BLUE_GATT_PROCEDURE_COMPLETE \n");
          APPL_MESG_DBG("\n");

          uint8_t index;
              
          index = 0;
          while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                (aLBRClientContext[index].connHandle != pr->conn_handle))
          {
            index++;
          }

          if(index < BLE_CFG_CLT_MAX_NBR_CB)
          {
            SCH_SetTask(CFG_IdleTask_SearchService);
          }
        }
        break; /*EVT_BLUE_GATT_PROCEDURE_COMPLETE*/
        default:
          break;
      }
    }

    break; /* HCI_EVT_VENDOR_SPECIFIC */

    default:
      break;
  }

  return(return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */



/* Public functions ----------------------------------------------------------*/

/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void LBR_Client_Init(void)
{
  uint8_t index =0;
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
    aLBRClientContext[index].state= LBC_IDLE;
  /**
   *  Register the event handler to the BLE controller
   */
  SVCCTL_RegisterCltHandler(LBR_Client_Event_Handler);

