Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/P2P_LedButton/Src/lb_demo.c
  APPL_MESG_DBG("-- LED BUTTON CLIENT INITIALIZED \n");
  
  return;
}

void LBR_Client_Update_Service()
{
  uint16_t enable = 0x0001;
  uint8_t index;
  index = 0;
  
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
        (aLBRClientContext[index].state != LBC_IDLE))
  {
  
  
    switch(aLBRClientContext[index].state)
    {
      case LBC_DISCOVER_SERVICES:
        APPL_MESG_DBG("LBC_DISCOVER_SERVICES\n");
        break;
      case LBC_DISCOVER_CHARACS:
        APPL_MESG_DBG("* GATT : Discover Led Button  Characteristics\n");
        aci_gatt_disc_all_charac_of_serv(aLBRClientContext[index].connHandle,
                                                aLBRClientContext[index].LedButtonServiceHandle,
                                                aLBRClientContext[index].LedButtonServiceEndHandle);
        break;
      case LBC_DISCOVER_LED_CHAR_DESC: //Not Used - No decriptor
        APPL_MESG_DBG("* GATT : Discover Descriptor of Led Characteritic\n");
        aci_gatt_disc_all_charac_descriptors(aLBRClientContext[index].connHandle,
                                                    aLBRClientContext[index].LedButtonLedCharHdle,
                                                    aLBRClientContext[index].LedButtonLedCharHdle+2);
        break;  
      case LBC_DISCOVER_BUTTON_CHAR_DESC:
        APPL_MESG_DBG("* GATT : Discover Descriptor of Button Characteritic\n");
        aci_gatt_disc_all_charac_descriptors(aLBRClientContext[index].connHandle,
                                                    aLBRClientContext[index].LedButtonClientCharHdle,
                                                    aLBRClientContext[index].LedButtonClientCharHdle+2);
        break;  
      case LBC_ENABLE_NOTIFICATION_BUTTON_DESC:
        APPL_MESG_DBG("* GATT : Enable Button Notification\n");
        aci_gatt_write_charac_descriptor(aLBRClientContext[index].connHandle,
                                                aLBRClientContext[index].LedButtonClientDescHandle,
                                                2,
                                                (uint8_t *)&enable);
      
        aLBRClientContext[index].state = LBC_CONNECTED;
        break;
      case LBC_DISABLE_NOTIFICATION_TX_DESC :
        APPL_MESG_DBG("* GATT : Disable Button Notification\n");
        aci_gatt_write_charac_descriptor(aLBRClientContext[index].connHandle,
                                                aLBRClientContext[index].LedButtonClientDescHandle,
                                                2,
                                                (uint8_t *)&enable);
      
        aLBRClientContext[index].state = LBC_CONNECTED;
        break;
      default:
        break;
    }
    index++;
  }
  return;
}



/**
 * @brief  Feature Characteristic update
 * @param  pFeatureValue: The address of the new value to be written
 * @retval None
 */
tBleStatus LBR_Client_Update_Char(uint16_t UUID, uint8_t Service_Instance, uint8_t *pPayload)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index;
  
  index = 0;
  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
        (aLBRClientContext[index].state != LBC_IDLE))
  {
    switch(UUID)
    {
      case LED_CHAR_UUID: // SERVER RX -- so CLIENT TX
      ret =aci_gatt_write_without_response(aLBRClientContext[index].connHandle,
                                        aLBRClientContext[index].LedButtonLedCharHdle,
                                        2, /* charValueLen */
                                         (const uint8_t *)  pPayload);
      
      break;
   
      default:
        break;
    }
    index++;
  }

  return ret;
}/* end LBR_Client_Update_Char() */


void LBR_App_Key_Button_Action(void)
{
  SCH_SetTask(CFG_IdleTask_Button);
}

LBR_Gap_Gatt_State LBR_Get_Client_Connection_Status(uint16_t Connection_Handle)
{
  if(LBRContext.connectionHandleRemote == Connection_Handle) 
  {
    return LBRContext.Remote_Connection_Status[0];
  }  
  else 
  {
    return LBC_IDLE;
  }
}

#endif // LB CLIENT


/****************************************************************/
/*                                                              */
/*                     DEVICE IS SERVER                         */
/****************************************************************/

#if(LB_SERVER!=0) 
void LBR_Adv_Request(void)
{
  if(LBRContext.Remote_Connection_Status [0]!= LBC_CONNECTED )
  {
    tBleStatus result=0x00;
    
    result = aci_gap_set_discoverable(ADV_IND,
                             LEDBUTTON_CONN_ADV_INTERVAL_MIN,
                             LEDBUTTON_CONN_ADV_INTERVAL_MAX,
                             PUBLIC_ADDR,
                             NO_WHITE_LIST_USE, /* use white list */
                             sizeof(local_name),
                             local_name,
                             0,
                             NULL,
                             0,
                             0);
    /* Send Advertising data */
   
    if( result == BLE_STATUS_SUCCESS )  {
      APPL_MESG_DBG("  \r\n\r");
      APPL_MESG_DBG("** START ADVERTISING **  \r\n\r");
    }  
    else   
    {
      APPL_MESG_DBG("** START ADVERTISING **  Failed \r\n\r");
    }
  }
  return;
}

void SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_le_connection_complete * connection_complete_event;

  event_pckt = (hci_event_pckt*)((hci_uart_pckt *)pckt)->data;
  evt_disconn_complete *cc = (void *)event_pckt->data;
  switch(event_pckt->evt)
  {
    case EVT_DISCONN_COMPLETE:
      if(cc->handle == LBRContext.connectionHandleRemote)
      {
        LBRContext.connectionHandleRemote = LBC_IDLE;
        APPL_MESG_DBG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
        handleNotification.LBR_Evt_Opcode=LB_CLIENT_DISCON_EVT_EVT;
        handleNotification.ConnectionHandle=connection_handle;
        LBR_Notification(&handleNotification);
      
      }
      break; /* EVT_DISCONN_COMPLETE */

    case EVT_LE_META_EVENT:
      meta_evt = (evt_le_meta_event*)event_pckt->data;
      switch(meta_evt->subevent)
      {
        case EVT_LE_CONN_COMPLETE:
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (evt_le_connection_complete *)meta_evt->data;
         
          connection_handle = connection_complete_event->handle;
      
          //CONNECTION WITH LB ROUTEUR 
           APPL_MESG_DBG("\r\n\r** CONNECTION EVENT WITH CLIENT \n");
          LBRContext.connectionHandleRemote = connection_handle;
          handleNotification.LBR_Evt_Opcode=LB_CLIENT_CONN_HANDLE_EVT;
          handleNotification.ConnectionHandle=connection_handle;
          LBR_Notification(&handleNotification);
         
          
         break; /* HCI_EVT_LE_CONN_COMPLETE */

        default:
          break;
      }
      break; /* HCI_EVT_LE_META_EVENT */

    default:
      break;
  }
  return;
}

void LBR_App_Key_Button_Action(void)
{
  SCH_SetTask(CFG_IdleTask_Button);
}

#endif 

void BLESVC_InitCustomSvc(void)
{
#if(LB_SERVER!=0) 
  LBS_STM_Init();
#endif    
  return;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
